read_verilog sail-core/verilog/adder.v sail-core/verilog/dsp_register.v sail-core/verilog/cpu.v sail-core/verilog/mux2to1.v sail-core/verilog/alu_control.v sail-core/verilog/pipeline_registers.v sail-core/verilog/alu.v sail-core/verilog/program_counter.v sail-core/verilog/branch_decide.v sail-core/verilog/forwarding_unit.v sail-core/verilog/branch_predictor.v sail-core/verilog/imm_gen.v sail-core/verilog/control_unit.v sail-core/verilog/instruction_mem.v sail-core/verilog/data_mem.v sail-core/verilog/register_file.v sail-core/verilog/CSR.v sail-core/verilog/dataMem_mask_gen.v toplevel.v

synth_ice40 -noflatten -blif sail.blif

write_json sail.json
